# 3

In [1]:
import pandas as pd
import pymysql

In [2]:
conn1=pymysql.connect(host='127.0.0.1',user='root',password='1234',db='Tabledb',charset='utf8')

In [3]:
cur_1=conn1.cursor()

In [4]:
sql='''DESC usertbl;'''

In [5]:
cur_1.execute(sql)
rows_1=cur_1.fetchall()
conn1.close()

In [6]:
pd_1=pd.DataFrame(rows_1)
pd_1.head()

           0            1    2    3     4 5
0     userID      char(8)   NO  PRI  None
1       name  varchar(10)  YES       None
2  birthYear          int  YES       None
3       addr      char(2)  YES       None
4    mobile1      char(3)  YES       None

# 8

In [7]:
import pandas as pd
import pymysql

In [8]:
conn1=pymysql.connect(host='127.0.0.1',user='root',password='1234',db='Tabledb',charset='utf8')

In [9]:
cur_1=conn1.cursor()

In [10]:
sql='''SELECT B.userid, U.name, B.prodName, U.addr, CONCAT(U.mobile1, U.mobile2)  AS '연락처'
   FROM buytbl B
     INNER JOIN usertbl U
        ON B.userid = U.userid ;'''

In [11]:
cur_1.execute(sql)
rows_1=cur_1.fetchall()
conn1.close()

In [15]:
pd_1=pd.DataFrame(rows_1)
pd_1

     0    1    2   3           4
0  KBS  김범수  운동화  경남  0112222222
1  KBS  김범수  노트북  경남  0112222222
2  JYP  조용필  모니터  경기  0114444444
3  KBS  김범수  청바지  경남  0112222222
4  SSK  성시경    책  서울        None
5  EJW  은지원    책  경북  0118888888
6  EJW  은지원  청바지  경북  0118888888
7  EJW  은지원    책  경북  0118888888

In [16]:
import pandas as pd
import pymysql

In [17]:
conn1=pymysql.connect(host='127.0.0.1',user='root',password='1234',db='Tabledb',charset='utf8')

In [18]:
cur_1=conn1.cursor()

In [19]:
sql='''SELECT COUNT(*) FROM buytbl;'''

In [20]:
cur_1.execute(sql)
rows_1=cur_1.fetchall()
conn1.close()

In [21]:
pd_1=pd.DataFrame(rows_1)
pd_1

    0
0  12

In [22]:
import pandas as pd
import pymysql

In [23]:
conn1=pymysql.connect(host='127.0.0.1',user='root',password='1234',db='Tabledb',charset='utf8')

In [24]:
cur_1=conn1.cursor()

In [25]:
sql='''SELECT B.userid, U.name, B.prodName, U.addr, CONCAT(U.mobile1, U.mobile2) AS '연락처'
   FROM buytbl B
     LEFT OUTER JOIN usertbl U
        ON B.userid = U.userid
   ORDER BY B.userid ;'''

In [26]:
cur_1.execute(sql)
rows_1=cur_1.fetchall()
conn1.close()

In [28]:
pd_1=pd.DataFrame(rows_1)
pd_1

      0     1    2     3           4
0   BBK  None  모니터  None        None
1   BBK  None  메모리  None        None
2   BBK  None  운동화  None        None
3   BBK  None  운동화  None        None
4   EJW   은지원    책    경북  0118888888
5   EJW   은지원  청바지    경북  0118888888
6   EJW   은지원    책    경북  0118888888
7   JYP   조용필  모니터    경기  0114444444
8   KBS   김범수  운동화    경남  0112222222
9   KBS   김범수  노트북    경남  0112222222
10  KBS   김범수  청바지    경남  0112222222
11  SSK   성시경    책    서울        None

# 11

In [29]:
import pandas as pd
import pymysql

In [30]:
conn1=pymysql.connect(host='127.0.0.1',user='root',password='1234',db='Tabledb',charset='utf8')

In [31]:
cur_1=conn1.cursor()

In [32]:
sql='''SELECT B.userid, U.name, B.prodName, U.addr, CONCAT(U.mobile1, U.mobile2) AS '연락처'
   FROM buytbl B
     INNER JOIN usertbl U
        ON B.userid = U.userid
  ORDER BY B.userid;'''

In [33]:
cur_1.execute(sql)
rows_1=cur_1.fetchall()
conn1.close()

In [35]:
pd_1=pd.DataFrame(rows_1)
pd_1

      0    1    2   3           4
0   EJW  은지원    책  경북  0118888888
1   EJW  은지원  청바지  경북  0118888888
2   EJW  은지원    책  경북  0118888888
3   JYP  조용필  모니터  경기  0114444444
4   KBS  김범수  운동화  경남  0112222222
5   KBS  김범수  노트북  경남  0112222222
6   KBS  김범수  청바지  경남  0112222222
7   SSK  성시경    책  서울        None
8   VVK  바비킴  모니터  서울  0100000000
9   VVK  바비킴  메모리  서울  0100000000
10  VVK  바비킴  운동화  서울  0100000000
11  VVK  바비킴  운동화  서울  0100000000

# 13

In [36]:
import pandas as pd
import pymysql

In [37]:
conn1=pymysql.connect(host='127.0.0.1',user='root',password='1234',db='Tabledb',charset='utf8')

In [38]:
cur_1=conn1.cursor()

In [39]:
sql='''SELECT * FROM buytbl ;'''

In [40]:
cur_1.execute(sql)
rows_1=cur_1.fetchall()
conn1.close()

In [41]:
pd_1=pd.DataFrame(rows_1)
pd_1

    0    1    2     3     4  5
0   1  KBS  운동화  None    30  2
1   2  KBS  노트북    전자  1000  1
2   3  JYP  모니터    전자   200  1
3   7  KBS  청바지    의류    50  3
4   9  SSK    책    서적    15  5
5  10  EJW    책    서적    15  2
6  11  EJW  청바지    의류    50  1
7  13  EJW    책    서적    15  1